{
  "projects": [
    {
      "id": 0,
      "title": "Booki",
      "image": "/images/projects/booki2.webp",
      "banner": "/images/banner/banner_booki.png",
      "client": "Booki - Réservation d'hébergements et d'activités",
      "presentation": "Booki est une solution web responsive visant à simplifier la recherche d'hébergements et d'activités en fonction d'une localisation donnée. ",
      "objectif": "En utilisant les maquettes fournies par l'UI Designer via l'outil Figma, mon rôle en tant que développeur Front-End est de créer une solution technique en utilisant exclusivement les technologies HTML et CSS pour la création de l'UI.",
      "technologies": ["HTML5", "CSS3", "Figma", "Responsive Design"],
      "tag": ["All", "Web"],
      "gitUrl": "https://github.com/Arsonist-932/P3-Booki",
      "previewUrl": "https://arsonist-932.github.io/P3-Booki/"
    },
    {
      "id": 1,
      "title": "OhMyFood",
      "image": "/images/projects/ohmyfood.webp",
      "banner": "/images/banner/banner_ohmyfood.png",
      "client": "OhMyFood",
      "presentation": "Ohmyfood! est une entreprise de commande de repas en ligne. Le concept permet aux utilisateurs de composer leur propre menu et réduire leur temps d’attente dans les restaurants car leur menu est préparé à l’avance. Plus de perte de temps à consulter la carte !",
      "objectif": "En utilisant les maquettes fournies par l'UI Designer via l'outil Figma, mon rôle en tant que développeur Front-End est de créer une solution technique en utilisant  les technologies HTML et Sass pour la création de l'UI, ainsi que la mise en place d'animations comme le loader.",
      "technologies": ["HTML5", "Sass", "Animation", "Responsive Design"],
      "tag": ["All", "Web"],
      "gitUrl": "https://github.com/Arsonist-932/P4-Ohmyfood",
      "previewUrl": "https://arsonist-932.github.io/P4-Ohmyfood/"
    },
    {
      "id": 2,
      "title": "Sophie Bluel",
      "banner": "/images/banner/banner_sophieBluel.png",
      "image": "/images/projects/sophie-bluel.webp",
      "client": "Agence ArchiWebos - Sophie Bluel",
      "presentation": "Sophie Bluel est une photographe qui souhaite développer son entreprise de photographie en créant un ste portolio afin de montrer son travail.",
      "objectif": "En utilisant les maquettes fournies par l'UI Designer via l'outil Figma et un tableau Kanban, mon rôle en tant que développeur Front-End est la création d'une UI qui permet la présentation des projets du clients. Pour la création de cette interface, différentes options comme le filtrage des projets par catégories, l'intégration d'une page de connexion en utilisant la technologie JWT (JSON Web Token) pour l'authentification, ainsi qu'une page admin permettant la gestion des projets (ajout, suppression). La solution à été développer avec HTML, Javascript et Sass pour un site dynamique afin de générer le contenu et la communication avec une API",
      "technologies": [
        "HTML5",
        "Sass",
        "Javascript",
        "Node.js",
        "Swagger",
        "JWT"
      ],
      "tag": ["All", "Web"],
      "gitUrl": "https://github.com/Arsonist-932/P6-Portfolio",
      "previewUrl": "https://arsonist-932.github.io/P6-Portfolio/"
    },
    {
      "id": 3,
      "title": "Kasa",
      "banner": "/images/banner/banner_kasa.png",
      "image": "/images/projects/kasa.webp",
      "client": "Kasa - Agence Immobilière entre particulier",
      "presentation": "Kasa est un site de location d'appartements entre particuliers, qui a été codé en ASP.NET et qui souhaite faire une refonte de son site vers un stack Javascript plus moderne : React",
      "objectif": "Pour ce projet, mon rôle en tant que developpeur Web est de concevoir l'interface utilisateur responsive en utilsant la technologie React côté front-end et Node.js côté back-end. Pour cette solution web, j'ai donc mis en place une interface conviviale, la mise en place d'un carroussel pour les images des appartements à partir de données internes, la mise en place de collapse pour améliorer l'expérience utilisateur",
      "technologies": ["React", "SASS", "Responsive Design", "Node.js"],
      "tag": ["All", "React"],
      "gitUrl": "https://github.com/Arsonist-932/p8-kasa",
      "previewUrl": "https://p8-kasa-lake.vercel.app/"
    },
    {
      "id": 4,
      "title": "Nina Carducci",
      "banner": "/images/banner/banner-nina.jpg",
      "image": "/images/projects/nina-carducci.webp",
      "client": "Nina Carducci - Photographe",
      "presentation": "Nina Carducci est une photographe professionnelle spécialisée dans les portraits et la photographie événementielle. Le site a pour but de présenter le portfolio de la photographe et de mettre en valeur ses réalisations.",
      "objectif": "Le but de ce projet était de fournir une prestation portant sur l'optimisation de son site portfolio, tant sur les performance, que le référencement et l'accessibilité. Mon rôle dans ce projet était porté sur la restructuration du code du site, l'optimisation des images, la mise en place d'un référencement local via Schema.org, Optimisation du SEO et de l'accessibilité, mise en place des Rich Snippets pour une meilleure visilibité sur les moteurs de recherche afin de garantir une meilleure visibilité, de meilleures performances du site. ",
      "technologies": [
        "HTML5",
        "Wave",
        "SEO",
        "LightHouse",
        "Rich Snippets",
        "Référencement Local",
        "Accessibilité"
      ],
      "tag": ["All", "Web"],
      "gitUrl": "https://github.com/Arsonist-932/P9-NinaCarducci",
      "previewUrl": "https://arsonist-932.github.io/P9-NinaCarducci/"
    },
    {
      "id": 5,
      "title": "724events",
      "banner": "/images/banner/banner-77events.png",
      "image": "/images/projects/724events.webp",
      "client": "724events",
      "presentation": "724events est une agence évènementiel qui souhaite mettre en ligne la nouvelle version de son site vitrine avec le stack React, le développeur en charge du projet a dû partir et n'a pas pu finir le site qui présente encore des bugs à corriger. ",
      "objectif": "Pour ce projet, mon rôle était de corriger les bugs existants. J'ai alors pris connaissance du code pour identifier les défauts présents dans celui-ci. L'utlisation de l'extension React DevTools, m'a également permis de comprendre le comportement de certains composants. L'utilisation de test unitaires et fonctionnels avec JEST m'ont permis de résoudre les dysfonctionnement liés au site. J'ai également créé un cahier de recette pour permettre la gestion des différents scénarios attendus.",
      "technologies": [
        "React",
        "JEST",
        "Debogage",
        "Tests Unitaires",
        "Tests Fonctionnels"
      ],
      "tag": ["All", "React"],
      "gitUrl": "https://github.com/Arsonist-932/P10-724events",
      "previewUrl": "https://p10-724events.vercel.app/"
    },
    {
      "id": 6,
      "title": "Argent Bank",
      "image": "/images/projects/argentBank.webp",
      "banner": "/images/banner/banner_argent.png",
      "client": "ArgentBank - Banque en ligne",
      "presentation": "ArgentBank est une agence bancaire en ligne avec un système de connexion utilisant une authentification JWT (JSON Web Token) pour ce connecter a un dashbord afin de visualiser leurs comptes bancaires. ",
      "objectif": "Mon rôle pour ce projet était de concevoir une interface utilisateur avec React, et Redux pour la gestion des informations. L'intégration d'une page de connexion avec une authentification JWT avec axios afin de communiquer avec une base de données. L'utilisation de Rédux pour le stockage et la gestion des informations utilisateurs. L'utilisattion de Swagger pour définir les spécifications API, en créant les routes nécessaires à la récupération des transactions via l'API. L'utilisation du Green Code avec des composant réutilisables pour réduire l'inmpact environnemental",
      "technologies": [
        "Green Code",
        "React",
        "Redux",
        "JWT",
        "Sass",
        "Axios",
        "Swagger",
        "MongoDB"
      ],
      "tag": ["All", "React"],
      "gitUrl": "https://github.com/Arsonist-932/P11-ArgentBank",
      "previewUrl": "https://p11-argent-bank.vercel.app/"
    }
  ],

  "skills": [
    {
      "id": "Dev",
      "content": [
        {
          "title": "Javascript",
          "img": "/images/icons_skills/javascript.png"
        },
        { "title": "React", "img": "/images/icons_skills/react.webp" },
        { "title": "Redux", "img": "/images/icons_skills/redux.png" },
        { "title": "Next.js", "img": "/images/icons_skills/next-js.png" }
      ]
    },
    {
      "id": "DevOps",
      "content": [
        { "title": "RDW", "img": "/images/icons_skills/responsive.webp" },
        { "title": "Sass", "img": "/images/icons_skills/sass.svg" },
        {
          "title": "Tailwind",
          "img": "/images/icons_skills/tailwind.png"
        },

        {
          "title": "Figma",
          "img": "/images/icons_skills/figma.svg"
        }
      ]
    },
    {
      "id": "Outils",
      "content": [
        { "title": "VScode", "img": "/images/icons_skills/vscode.webp" },

        { "title": "Node.js", "img": "/images/icons_skills/nodejs.webp" },
        { "title": "Github", "img": "/images/icons_skills/github.webp" },
        { "title": "Trello", "img": "/images/icons_skills/trello.png" }
      ]
    }
  ]
}
